# Label And Odinal Encoder

In [4]:
import pandas as pd

In [5]:
from sklearn.preprocessing import LabelEncoder

In [7]:
# create a sample dataframe with a categorical variable
df=pd.DataFrame({
    "color":["red","blue","green","red","blue"]
})

In [8]:
df

   color
0    red
1   blue
2  green
3    red
4   blue

In [ ]:
# create an instance of labelEncoder

In [9]:
encoder=LabelEncoder()

In [11]:
encoder.fit_transform(df["color"])

array([2, 0, 1, 2, 0])

In [12]:
## Ordinal Encoding
from sklearn.preprocessing import OrdinalEncoder

# create a sample dataframe with an ordinal variable
df=pd.DataFrame({
    "size": ["small",'medium','large','medium','small','large']
})

In [13]:
df

     size
0   small
1  medium
2   large
3  medium
4   small
5   large

In [16]:
## create an instance of the ordinalEncoder class and fir_transform
ordinal=OrdinalEncoder(categories=[["small",'medium','large']])

In [18]:
ordinal.fit_transform(df[["size"]])

array([[0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.]])

# Target  Guided Ordinzl Encoding

In [22]:
import pandas as pd
# create a sample dataframe with a categorical variables and a target varable
df=pd.DataFrame({
    "city" :['New York','London',"Paris","Tokyo","New York",'Paris'],
    "price":[200,150,300,250,180,320]
})

In [23]:
df

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New York    180
5     Paris    320

In [25]:
# calcualate the mean price for each city
mean_price=df.groupby("city")["price"].mean().to_dict()
mean_price

{'London': 150.0, 'New York': 190.0, 'Paris': 310.0, 'Tokyo': 250.0}

In [27]:
## Replace each city with its mean price
df["city_encoded"]=df["city"].map(mean_price)

In [28]:
df

       city  price  city_encoded
0  New York    200         190.0
1    London    150         150.0
2     Paris    300         310.0
3     Tokyo    250         250.0
4  New York    180         190.0
5     Paris    320         310.0

In [29]:
import seaborn as sns

In [30]:
sns.load_dataset("tips")

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]